Repository: pypi-data/pypi-mirror-344
Catalog: packages/trytond-product-measurements/trytond_product_measurements-7.6.0-py3-none-any.whl/trytond/modules/product_measurements/locale/*.po
Languages: pt

# field:product.product,height:
source: Height
pt: Altura

# field:product.product,height_uom:
source: Height UoM
pt: UdM da Altura

# field:product.product,length:
source: Length
pt: Comprimento

# field:product.product,length_uom:
source: Length UoM
pt: UdM do Comprimento

# field:product.product,volume_uom:
source: Volume UoM
pt: UdM do Volume

# field:product.product,weight:
source: Weight
pt: Peso

# field:product.product,weight_uom:
source: Weight UoM
pt: UdM do Peso

# field:product.product,width:
source: Width
pt: Largura

# field:product.product,width_uom:
source: Width UoM
pt: UdM da Largura

# field:product.template,height:
source: Height
pt: Altura

# field:product.template,height_uom:
source: Height UoM
pt: UdM da Altura

# field:product.template,length:
source: Length
pt: Comprimento

# field:product.template,length_uom:
source: Length UoM
pt: UdM do Comprimento

# field:product.template,volume_uom:
source: Volume UoM
pt: UdM do Volume

# field:product.template,weight:
source: Weight
pt: Peso

# field:product.template,weight_uom:
source: Weight UoM
pt: UdM do Peso

# field:product.template,width:
source: Width
pt: Largura

# field:product.template,width_uom:
source: Width UoM
pt: UdM da Largura

# help:product.product,height:
source: Height for 1 default unit of measure.
pt: Altura para 1 unidade de medida padrão.

# help:product.product,height_uom:
source: The Unit of Measure for the height.
pt: A unidade de medida para altura.

# help:product.product,length:
source: Length for 1 default unit of measure.
pt: Comprimento para 1 unidade de medida padrão.

# help:product.product,length_uom:
source: The Unit of Measure for the length.
pt: A unidade de medida para o comprimento.

# help:product.product,volume:
source: Volume for 1 default unit of measure.
pt: Volume para 1 unidade de medida padrão.

# help:product.product,volume_uom:
source: The Unit of Measure for the volume.
pt: A unidade de medida para o volume.

# help:product.product,weight:
source: Weight for 1 default unit of measure.
pt: Peso para 1 unidade de medida padrão.

# help:product.product,weight_uom:
source: The Unit of Measure for the weight.
pt: A unidade de medida do peso.

# help:product.product,width:
source: Width for 1 default unit of measure.
pt: Largura para 1 unidade de medida padrão.

# help:product.product,width_uom:
source: The Unit of Measure for the width.
pt: A unidade de medida da largura.

# help:product.template,height:
source: Height for 1 default unit of measure.
pt: Altura para 1 unidade de medida padrão.

# help:product.template,height_uom:
source: The Unit of Measure for the height.
pt: A unidade de medida da altura.

# help:product.template,length:
source: Length for 1 default unit of measure.
pt: Comprimento para 1 unidade de medida padrão.

# help:product.template,length_uom:
source: The Unit of Measure for the length.
pt: A unidade de medida do comprimento.

# help:product.template,volume:
source: Volume for 1 default unit of measure.
pt: Volume para 1 unidade de medida padrão.

# help:product.template,volume_uom:
source: The Unit of Measure for the volume.
pt: A unidade de medida do volume.

# help:product.template,weight:
source: Weight for 1 default unit of measure.
pt: Peso para 1 unidade de medida padrão.

# help:product.template,weight_uom:
source: The Unit of Measure for the weight.
pt: A unidade de medida do peso.

# help:product.template,width:
source: Width for 1 default unit of measure.
pt: Largura para 1 unidade de medida padrão.

# help:product.template,width_uom:
source: The Unit of Measure for the width.
pt: A unidade de medida da largura.

# view:product.template:
source: Measurements
pt: Medidas

# view:product.template:
source: Measurements for 1 default UoM.
pt: Medidas para 1 UoM padrão.
