Repository: pypi-data/pypi-mirror-344
Catalog: packages/trytond-account-budget/trytond_account_budget-7.6.0.tar.gz/trytond_account_budget-7.6.0/locale/*.po
Languages: pt

# field:account.budget,company:
source: Company
pt: Companhia

# field:account.budget,fiscalyear:
source: Fiscal Year
pt: Ano Fiscal

# field:account.budget,lines:
source: Lines
pt: Linhas

# field:account.budget,name:
source: Name
pt: Nome

# field:account.budget,root_lines:
source: Lines
pt: Linhas

# field:account.budget.context,budget:
source: Budget
pt: Orçamento

# field:account.budget.context,fiscalyear:
source: Fiscal Year
pt: Ano Fiscal

# field:account.budget.context,periods:
source: Periods
pt: Periodos

# field:account.budget.context,posted:
source: Posted
pt: Contabilizado

# field:account.budget.copy.start,company:
source: Company
pt: Empresa

# field:account.budget.copy.start,factor:
source: Factor
pt: Fator

# field:account.budget.copy.start,fiscalyear:
source: Fiscal Year
pt: Ano Fiscal

# field:account.budget.copy.start,name:
source: Name
pt: Nome

# field:account.budget.line,account:
source: Account
pt: Quantidade

# field:account.budget.line,account_type:
source: Account Type
pt: Tipo de Conta

# field:account.budget.line,actual_amount:
source: Actual Amount
pt: Montante Real

# field:account.budget.line,amount:
source: Amount
pt: Montante

# field:account.budget.line,budget:
source: Budget
pt: Orçamento

# field:account.budget.line,children:
source: Children
pt: Filhos

# field:account.budget.line,company:
source: Company
pt: Empresa

# field:account.budget.line,currency:
source: Currency
pt: Moeda

# field:account.budget.line,current_name:
source: Current Name
pt: Nome Atual

# field:account.budget.line,left:
source: Left
pt: Esquerda

# field:account.budget.line,name:
source: Name
pt: Nome

# field:account.budget.line,parent:
source: Parent
pt: Pai

# field:account.budget.line,parent_account_type:
source: Parent Account Type
pt: Tipo de Conta Pai

# field:account.budget.line,percentage:
source: Percentage
pt: Porcentagem

# field:account.budget.line,periods:
source: Periods
pt: Periodos

# field:account.budget.line,right:
source: Right
pt: Direita

# field:account.budget.line,total_amount:
source: Total Amount
pt: Montante Total

# field:account.budget.line.create_periods.start,method:
source: Method
pt: Método

# field:account.budget.line.period,actual_amount:
source: Actual Amount
pt: Montante Real

# field:account.budget.line.period,budget_line:
source: Budget Line
pt: Linha do Orçamento

# field:account.budget.line.period,currency:
source: Currency
pt: Moeda

# field:account.budget.line.period,fiscalyear:
source: Fiscal Year
pt: Ano Fiscal

# field:account.budget.line.period,percentage:
source: Percentage
pt: Porcentagem

# field:account.budget.line.period,period:
source: Period
pt: Período

# field:account.budget.line.period,ratio:
source: Ratio
pt: Proporção

# field:account.budget.line.period,total_amount:
source: Total Amount
pt: Montante Total

# help:account.budget,company:
source: The company that the budget is associated with.
pt: A empresa à qual o orçamento está associado.

# help:account.budget,fiscalyear:
source: The fiscal year the budget applies to.
pt: O ano fiscal ao qual o orçamento se aplica.

# help:account.budget.context,posted:
source: Only include posted moves.
pt: Incluir apenas lançamentos confirmados.

# help:account.budget.copy.start,factor:
source: The percentage to apply to the budget line amounts.
pt: A porcentagem a ser aplicada aos valores das linhas do orçamento.

# help:account.budget.copy.start,fiscalyear:
source: The fiscal year during which the new budget will apply.
pt: O ano fiscal durante o qual o novo orçamento será aplicado.

# help:account.budget.line,account:
source: The account the budget applies to.
pt: A conta à qual o orçamento se aplica.

# help:account.budget.line,account_type:
source: The account type the budget applies to.
pt: O tipo de conta à qual o orçamento se aplica.

# help:account.budget.line,actual_amount:
source: The total amount booked against the budget line.
pt: O valor total contabilizado na linha do orçamento.

# help:account.budget.line,amount:
source: The amount allocated to the budget line.
pt: O valor alocado à linha do orçamento.

# help:account.budget.line,children:
source: Used to add structure below the budget.
pt: Usado para adicionar estrutura abaixo do orçamento.

# help:account.budget.line,parent:
source: Used to add structure above the budget.
pt: Usado para adicionar estrutura acima do orçamento.

# help:account.budget.line,percentage:
source: The percentage of booked amount of the budget line.
pt: A porcentagem do valor reservado da linha do orçamento.

# help:account.budget.line,periods:
source: The periods that contain details of the budget.
pt: Os períodos que contêm detalhes do orçamento.

# help:account.budget.line,total_amount:
source: The total amount allocated to the budget line and its children.
pt: O valor total alocado à linha do orçamento e seus filhos.

# help:account.budget.line.period,actual_amount:
source: The total amount booked against the budget line.
pt: O valor total contabilizado na linha do orçamento.

# help:account.budget.line.period,budget_line:
source: The line that the budget period is part of.
pt: A linha da qual o período de orçamento faz parte.

# help:account.budget.line.period,percentage:
source: The percentage of booked amount of the budget line.
pt: A porcentagem do valor reservado da linha do orçamento.

# help:account.budget.line.period,ratio:
source: The percentage allocated to the budget.
pt: A porcentagem alocada ao orçamento.

# help:account.budget.line.period,total_amount:
source: The total amount allocated to the budget and its children.
pt: O valor total alocado ao orçamento e seus filhos.

# model:account.budget,string:
source: Account Budget
pt: Conta de Orçamento

# model:account.budget.context,string:
source: Account Budget Context
pt: Contexto da Conta de Orçamento

# model:account.budget.copy.start,string:
source: Account Budget Copy Start
pt: Início da cópia da Conta do Orçamento

# model:account.budget.line,string:
source: Account Budget Line
pt: Linha de Orçamento

# model:account.budget.line.create_periods.start,string:
source: Account Budget Line Create Periods Start
pt: Criar Períodos das Linha do Orçamento Contável

# model:account.budget.line.period,string:
source: Account Budget Line Period
pt: Período da Linha do Orçamento da Contável
