Repository: pypi-data/pypi-mirror-344
Catalog: packages/trytond-timesheet-cost/trytond_timesheet_cost-7.6.0-py3-none-any.whl/trytond/modules/timesheet_cost/locale/*.po
Languages: pt

# field:company.employee,cost_price:
source: Cost Price
pt: Preço de custo

# field:company.employee,cost_prices:
source: Cost Prices
pt: Preços de custo

# field:company.employee_cost_price,cost_price:
source: Cost Price
pt: Preços de custo

# field:company.employee_cost_price,date:
source: Date
pt: Data

# field:company.employee_cost_price,employee:
source: Employee
pt: Empregado

# field:timesheet.line,cost_price:
source: Cost Price
pt: Preço de custo

# help:company.employee,cost_price:
source: Hourly cost price for this Employee.
pt: Preço de custo por hora deste empregado.

# help:company.employee,cost_prices:
source: List of hourly cost price over time.
pt: Lista de preços de custo por hora ao longo do tempo.

# help:company.employee_cost_price,cost_price:
source: Hourly cost price.
pt: Preço de custo por hora.

# model:company.employee_cost_price,string:
source: Company Employee Cost Price
pt: Preço de Custo do Empregado

# model:ir.message,text:msg_employee_unique_cost_price_date
source: An employee can only have one cost price by date.
pt: Um empregado somente pode ter um preço de custo por data.

# view:company.employee:
source: Cost
pt: Custo
