Repository: pypi-data/pypi-mirror-344
Catalog: packages/trytond-party/trytond_party-7.6.0.tar.gz/trytond_party-7.6.0/locale/*.po
Languages: pt

# selection:party.configuration,identifier_types:
source: Dutch Student Identification Number
pt: Número de Identificação Estudantil Holandês

# selection:party.configuration,identifier_types:
source: Dutch VAT Number
pt: Número VAT Holandês

# selection:party.configuration,identifier_types:
source: Ecuadorian Personal Identity Code
pt: Código de Identificação Pessoal Equatoriano

# selection:party.configuration,identifier_types:
source: Ecuadorian Tax Identification
pt: Identificador Fiscal Equatoriano

# selection:party.configuration,identifier_types:
source: Egyptian Tax Registration Number
pt: Identificador Fiscal Egípcio

# selection:party.configuration,identifier_types:
source: El Salvador Tax Number
pt: Número Fiscal de El Salvador

# selection:party.configuration,identifier_types:
source: English Unique Pupil Number
pt: Número Único de Aluno Inglês

# selection:party.configuration,identifier_types:
source: Estonian Organisation Registration Code
pt: Código de Registro de Organização Estoniano

# selection:party.configuration,identifier_types:
source: Estonian Personal ID Number
pt: Número de ID Pessoal Estoniano

# selection:party.configuration,identifier_types:
source: Estonian VAT Number
pt: Número VAT Estoniano

# selection:party.configuration,identifier_types:
source: European VAT Number
pt: Número VAT Europeu

# selection:party.configuration,identifier_types:
source: European VAT on e-Commerce - One Stop Shop
pt: VAT Europeu para e-Commerce - Loja Única

# selection:party.configuration,identifier_types:
source: Faroese Tax Number
pt: Número Fiscal Faroês

# selection:party.configuration,identifier_types:
source: Finnish Association Identifier
pt: Identificador de Associação Finlandês

# selection:party.configuration,identifier_types:
source: Finnish Business Identifier
pt: Identificador de Negócios Finlandês

# selection:party.configuration,identifier_types:
source: Finnish Individual Tax Number
pt: Número Fiscal Individual Finlandês

# selection:party.configuration,identifier_types:
source: Finnish Personal Identity Code
pt: Código de Identificação Pessoal Finlandês

# selection:party.configuration,identifier_types:
source: Finnish VAT Number
pt: Número VAT Finlandês

# selection:party.configuration,identifier_types:
source: French Company Establishment Identification Number
pt: Número de Identificação de Estabelecimento de Companhias Francês

# selection:party.configuration,identifier_types:
source: French Company Identification Number
pt: Número de Identificação de Companhias Francês

# selection:party.configuration,identifier_types:
source: French Personal Identification Number
pt: Número de Identificação Pessoal Francês

# selection:party.configuration,identifier_types:
source: French Tax Identification Number
pt: Identificador de Tributo Francês

# selection:party.configuration,identifier_types:
source: French VAT Number
pt: Número VAT Francês

# selection:party.configuration,identifier_types:
source: German Company Register Number
pt: Número de Registro de Companhias Alemão

# selection:party.configuration,identifier_types:
source: German Personal Tax Number
pt: Número Fiscal Pessoal Alemão

# selection:party.configuration,identifier_types:
source: German Tax Number
pt: Número Fiscal Alemão

# selection:party.configuration,identifier_types:
source: German VAT Number
pt: Número VAT Alemão

# selection:party.configuration,identifier_types:
source: Ghanaian Taxpayer Identification Number
pt: Número Identificador de Contribuinte Ganês

# selection:party.configuration,identifier_types:
source: Greek Social Security Number
pt: Nùmero de Segurança Social Grego

# selection:party.configuration,identifier_types:
source: Greek VAT Number
pt: Número VAT Grego

# selection:party.configuration,identifier_types:
source: Guatemala Tax Number
pt: Número Fiscal da Guatemala

# selection:party.configuration,identifier_types:
source: Guinean Tax Number
pt: Número Fiscal Guineense

# selection:party.configuration,identifier_types:
source: Hungarian VAT Number
pt: Número VAT Húngaro

# selection:party.configuration,identifier_types:
source: Icelandic Personal and Organisation Identity Code
pt: Código Identificador Pessoal e Organizacional Islandês

# selection:party.configuration,identifier_types:
source: Icelandic VAT Number
pt: Número VAT Islandês

# selection:party.configuration,identifier_types:
source: Indian Digital Resident Personal Identity Number
pt: Número Digital de Identificação Pessoal de Residente Indiano

# selection:party.configuration,identifier_types:
source: Indian Income Tax Identifier
pt: Identificador Fiscal Indiano

# selection:party.configuration,identifier_types:
source: Indian VAT number
pt: Número VAT Indiano

# selection:party.configuration,identifier_types:
source: Indian Voter ID
pt: ID de Eleitor Indiano

# selection:party.configuration,identifier_types:
source: Indonesian VAT Number
pt: Número VAT Indonésio

# selection:party.configuration,identifier_types:
source: Irish Personal Number
pt: Número Pessoal Irlandês

# selection:party.configuration,identifier_types:
source: Irish VAT Number
pt: Número VAT Irlandês

# selection:party.configuration,identifier_types:
source: Israeli Company Number
pt: Número de Companhia Israelita

# selection:party.configuration,identifier_types:
source: Israeli Identity Number
pt: Número de Identidade Israelita

# selection:party.configuration,identifier_types:
source: Italian Tax Code for Individuals
pt: Código Fiscal para Indivíduos Italiano

# selection:party.configuration,identifier_types:
source: Italian VAT Number
pt: Número VAT Italiano

# selection:party.configuration,identifier_types:
source: Japanese Corporate Number
pt: Número Corporativo Japonês

# selection:party.configuration,identifier_types:
source: Kenya Tax Number
pt: Número Fiscal Keniano

# selection:party.configuration,identifier_types:
source: Latvian VAT Number
pt: Número VAT Letão

# selection:party.configuration,identifier_types:
source: Lithuanian Personal Number
pt: Número Pessoal Lituano

# selection:party.configuration,identifier_types:
source: Lithuanian VAT Number
pt: Número VAT Lituano

# selection:party.configuration,identifier_types:
source: Luxembourgian VAT Number
pt: Número VAT Luxemburguês

# selection:party.configuration,identifier_types:
source: Macedonian Tax Number
pt: Número Fiscal Macedônio

# selection:party.configuration,identifier_types:
source: Malaysian National Registration Identity Card Number
pt: Número de Cartão de Identificação de Registro Nacional Malaio

# selection:party.configuration,identifier_types:
source: Maltese VAT Number
pt: Número VAT Maltês

# selection:party.configuration,identifier_types:
source: Mauritian National Identifier
pt: Identificador Nacional Mauriciano

# selection:party.configuration,identifier_types:
source: Mexican Tax Number
pt: Número Fiscal Mexicano

# selection:party.configuration,identifier_types:
source: Moldavian Company Identification Number
pt: Número de Identificação de Companhia Moldávio

# selection:party.configuration,identifier_types:
source: Monacan VAT Number
pt: Número VAT de Mônaco

# selection:party.configuration,identifier_types:
source: Montenegro Tax Number
pt: Número Fiscal de Montenegro

# selection:party.configuration,identifier_types:
source: Moroccan Tax Number
pt: Número Fiscal Marroquino

# selection:party.configuration,identifier_types:
source: New Zealand Inland Revenue Department Number
pt: Número de Receita Interna de Departamento Neo-Zelandês

# selection:party.configuration,identifier_types:
source: Norwegian Birth Number, the National Identity Number
pt: Número de Nascimento Norueguês, o Número de Identidade Nacional

# selection:party.configuration,identifier_types:
source: Norwegian Organisation Number
pt: Número de Organização Norueguês

# selection:party.configuration,identifier_types:
source: Norwegian VAT Number
pt: Número VAT Noruegês

# selection:party.configuration,identifier_types:
source: Pakistani Computerised National Identity Card Number
pt: Número Computadorisado do Cartão de Identidade Nacional Paquistanês

# selection:party.configuration,identifier_types:
source: Paraguay Tax Number
pt: Número Fiscal Paraguaio

# selection:party.configuration,identifier_types:
source: Peruvian Company Tax Number
pt: Número Fiscal de Companhias Peruano

# selection:party.configuration,identifier_types:
source: Peruvian Identity Number
pt: Número de Identidade Peruano

# selection:party.configuration,identifier_types:
source: Polish National Identification Number
pt: Número Nacional de Identificação Polonês

# selection:party.configuration,identifier_types:
source: Polish Register of Economic Units
pt: Registro de Unidades Econômicas Polonês

# selection:party.configuration,identifier_types:
source: Polish VAT Number
pt: Número VAT Polonês

# selection:party.configuration,identifier_types:
source: Portuguese Identity Number
pt: Número de Identidade Nacional Português

# selection:party.configuration,identifier_types:
source: Portuguese VAT Number
pt: Número VAT Português

# selection:party.configuration,identifier_types:
source: Romanian Numerical Personal Code
pt: Código Pessoal Numérico Romeno

# selection:party.configuration,identifier_types:
source: Romanian ONRC Number
pt: Número ONRC Romeno

# selection:party.configuration,identifier_types:
source: Romanian VAT Number
pt: Número VAT Romeno

# selection:party.configuration,identifier_types:
source: Russian Tax identifier
pt: Identificador Fiscal Russo

# selection:party.configuration,identifier_types:
source: SEPA Identifier of the Creditor (AT-02)
pt: Identificador de Credor SEPA (AT-02)

# selection:party.configuration,identifier_types:
source: San Marino National Tax Number
pt: Número Fiscal Nacional de San Marino

# selection:party.configuration,identifier_types:
source: Serbian Tax Identification
pt: Identificador Fiscal Sérvio

# selection:party.configuration,identifier_types:
source: Singapore's Unique Entity Number
pt: Número de Entidade Único de Singapura

# selection:party.configuration,identifier_types:
source: Slovak Birth Number
pt: Número de Nascimento Eslováquio

# selection:party.configuration,identifier_types:
source: Slovak VAT Number
pt: Número VAT Eslováquio

# selection:party.configuration,identifier_types:
source: Slovenian Corporate Registration Number
pt: Número de Registro de Companhia Esloveno

# selection:party.configuration,identifier_types:
source: Slovenian Unique Master Citizen Number
pt: Número Único de Cidadão Esloveno

# selection:party.configuration,identifier_types:
source: Slovenian VAT Number
pt: Número VAT Esloveno

# selection:party.configuration,identifier_types:
source: South African Identity Document Number
pt: Número do Documento de Identificação Sul-Africano

# selection:party.configuration,identifier_types:
source: South African Tax Identification Number
pt: Número de Identificação Fiscal Sul-Africano

# selection:party.configuration,identifier_types:
source: South Korea Business Registration Number
pt: Número de registro comercial na Coreia do Sul

# selection:party.configuration,identifier_types:
source: South Korean Resident Registration Number
pt: Número de Registro de Residente Sul-Coreano

# selection:party.configuration,identifier_types:
source: Spanish Company Tax
pt: Número Fiscal de Companhias Espanhol

# selection:party.configuration,identifier_types:
source: Spanish Foreigner Number
pt: Número de Estrangeiros Espanhol

# selection:party.configuration,identifier_types:
source: Spanish Personal Identity Codes
pt: Códigos de Identificação Pessoal Espanhol

# selection:party.configuration,identifier_types:
source: Spanish VAT Number
pt: Número VAT Espanhol

# selection:party.configuration,identifier_types:
source: Swedish Company Number
pt: Número de Companhia Sueco

# selection:party.configuration,identifier_types:
source: Swedish Personal Number
pt: Número Pessoal Sueco

# selection:party.configuration,identifier_types:
source: Swedish VAT Number
pt: Número VAT Sueco

# selection:party.configuration,identifier_types:
source: Swiss Business Identifier
pt: Identificador de Negócios Suíço

# selection:party.configuration,identifier_types:
source: Swiss Social Security Number
pt: Número de Segurança Social Suíço

# selection:party.configuration,identifier_types:
source: Swiss VAT Number
pt: Número VAT Suíço

# selection:party.configuration,identifier_types:
source: Taiwanese Tax Number
pt: Número Fiscal Taiwanês

# selection:party.configuration,identifier_types:
source: Thai Memorandum of Association Number
pt: Número de Memorando de Associação Tailandês

# selection:party.configuration,identifier_types:
source: Thai Personal Identification Number
pt: Número de Identificação Pessoal Tailandês

# selection:party.configuration,identifier_types:
source: Thai Taxpayer Identification Number
pt: Número de Identificação de Contribuinte Tailandês

# selection:party.configuration,identifier_types:
source: Tunisian Tax Number
pt: Número Fiscal Tunísio

# selection:party.configuration,identifier_types:
source: Turkish Personal Identification Number
pt: Número de Identificação Pessoal Turco

# selection:party.configuration,identifier_types:
source: Turkish Tax Identification Number
pt: Número de Identificação Fiscal Turco

# selection:party.configuration,identifier_types:
source: U.S. Adoption Taxpayer Identification Number
pt: Número de Identificação do Contribuinte Adotante E.U.A

# selection:party.configuration,identifier_types:
source: U.S. Employer Identification Number
pt: Número de Identificação de Empregado E.U.A

# selection:party.configuration,identifier_types:
source: U.S. Individual Taxpayer Identification Number
pt: Número de Identificação Individual do Contribuinte E.U.A

# selection:party.configuration,identifier_types:
source: U.S. Preparer Tax Identification Number
pt: Número de Identificação Preparatória Fiscal E.U.A

# selection:party.configuration,identifier_types:
source: U.S. Social Security Number
pt: Número de Segurança Social E.U.A

# selection:party.configuration,identifier_types:
source: U.S. Taxpayer Identification Number
pt: Número de Identificação do Contribuinte E.U.A

# selection:party.configuration,identifier_types:
source: Ukrainian Identifier for Enterprises and Organizations
pt: Identificador para Empresas e Organizações Ucraniano

# selection:party.configuration,identifier_types:
source: Ukrainian Individual Taxpayer Registration Number
pt: Número de Registro de Contribuinte Ucraniano

# selection:party.configuration,identifier_types:
source: United Kingdom (and Isle of Man) VAT Number
pt: Número VAT do Reino Unido e Ilhas de Man

# selection:party.configuration,identifier_types:
source: United Kingdom National Health Service Patient Identifier
pt: Identificador de Paciente do Servico de Saúde Nacional do Reino Unido

# selection:party.configuration,identifier_types:
source: United Kingdom Unique Taxpayer Reference
pt: Referência Única de Contribuinte do Reino Unido

# selection:party.configuration,identifier_types:
source: Uruguay Tax Number
pt: Número Fiscal Uruguaio

# selection:party.configuration,identifier_types:
source: Venezuelan VAT Number
pt: Número VAT Venezuelano

# selection:party.configuration,identifier_types:
source: Vietnam Tax Number
pt: Número Fiscal Vietnamita

# selection:party.contact_mechanism,type:
source: Mobile
pt: Celular

# selection:party.contact_mechanism,type:
source: Other
pt: Outro

# selection:party.contact_mechanism,type:
source: Phone
pt: Telefone

# selection:party.contact_mechanism,type:
source: Website
pt: Sítio web

# view:party.address:
source: General
pt: Geral

# view:party.party:
source: General
pt: Geral

# view:party.replace.ask:
source: Party
pt: Pessoa

# view:party.replace.ask:
source: Replaced By
pt: Substituído Por

# wizard_button:party.erase,ask,end:
source: Cancel
pt: Cancelar

# wizard_button:party.erase,ask,erase:
source: Erase
pt: Excluir

# wizard_button:party.replace,ask,end:
source: Cancel
pt: Cancelar

# wizard_button:party.replace,ask,replace:
source: Replace
pt: Substituir
