Repository: pypi-data/pypi-mirror-344
Catalog: packages/trytond-party/trytond_party-7.6.0.tar.gz/trytond_party-7.6.0/locale/*.po
Languages: pt

# field:ir.email.template,contact_mechanism:
source: Contact Mechanism
pt: Meio de Contato

# field:party.address,building_name:
source: Building Name
pt: Nome do Prédio

# field:party.address,building_number:
source: Building Number
pt: Número do Prédio

# field:party.address,city:
source: City
pt: Cidade

# field:party.address,contact_mechanisms:
source: Contact Mechanisms
pt: Meios de Contato

# field:party.address,country:
source: Country
pt: País

# field:party.address,floor_number:
source: Floor Number
pt: Número do Andar

# field:party.address,full_address:
source: Full Address
pt: Endereço completo

# field:party.address,identifiers:
source: Identifiers
pt: Identificadores

# field:party.address,party:
source: Party
pt: Pessoa

# field:party.address,party_name:
source: Party Name
pt: Nome da Pessoa

# field:party.address,post_box:
source: Post Box
pt: Caixa de Correio

# field:party.address,post_office:
source: Post Office
pt: Correios

# field:party.address,postal_code:
source: Postal Code
pt: Código Postal

# field:party.address,private_bag:
source: Private Bag
pt: Bolsa Privada

# field:party.address,room_number:
source: Room Number
pt: Número da Sala

# field:party.address,street:
source: Street
pt: Rua

# field:party.address,street_name:
source: Street Name
pt: Nome da Rua

# field:party.address,street_single_line:
source: Street
pt: Rua

# field:party.address,street_unstructured:
source: Street
pt: Rua

# field:party.address,subdivision:
source: Subdivision
pt: UF

# field:party.address,subdivision_types:
source: Subdivision Types
pt: Tipo de Subdivisão

# field:party.address,unit_number:
source: Unit Number
pt: Número da Unidade

# field:party.address.format,building_number_format:
source: Building Number Format
pt: Formato do Número do Edifício

# field:party.address.format,country_code:
source: Country Code
pt: Código do País

# field:party.address.format,floor_number_format:
source: Floor Number Format
pt: Formato do Número do Andar

# field:party.address.format,format_:
source: Format
pt: Formato

# field:party.address.format,language_code:
source: Language Code
pt: Código de Idioma

# field:party.address.format,post_box_format:
source: Post Box Format
pt: Formato de Caixa de Correio

# field:party.address.format,post_office_format:
source: Post Box Format
pt: Formato de Caixa de Correio

# field:party.address.format,private_bag_format:
source: Post Box Format
pt: Formato de Caixa de Correio

# field:party.address.format,room_number_format:
source: Room Number Format
pt: Formato do Número da Sala

# field:party.address.format,street_format:
source: Street Format
pt: Formato de Endereço

# field:party.address.format,unit_number_format:
source: Unit Number Format
pt: Formato do Número da Unidade

# field:party.address.subdivision_type,country_code:
source: Country Code
pt: Código do País

# field:party.address.subdivision_type,types:
source: Subdivision Types
pt: Tipo de Subdivisão

# field:party.category,childs:
source: Children
pt: Filhos

# field:party.category,name:
source: Name
pt: Nome

# field:party.category,parent:
source: Parent
pt: Pai

# field:party.check_vies.result,parties_failed:
source: Parties Failed
pt: Falha em pessoas

# field:party.check_vies.result,parties_succeed:
source: Parties Succeed
pt: Sucesso em pessoas

# field:party.configuration,identifier_types:
source: Identifier Types
pt: Tipos Identificador

# field:party.configuration,party_lang:
source: Party Language
pt: Idioma da Pessoa

# field:party.configuration,party_sequence:
source: Party Sequence
pt: Sequência da pessoa

# field:party.configuration.party_lang,party_lang:
source: Party Language
pt: Idioma da Pessoa

# field:party.configuration.party_sequence,party_sequence:
source: Party Sequence
pt: Sequência da pessoa

# field:party.contact_mechanism,address:
source: Address
pt: Endereço

# field:party.contact_mechanism,comment:
source: Comment
pt: Comentário

# field:party.contact_mechanism,language:
source: Language
pt: Idioma

# field:party.contact_mechanism,languages:
source: Languages
pt: Idiomas

# field:party.contact_mechanism,name:
source: Name
pt: Nome

# field:party.contact_mechanism,other_value:
source: Value
pt: Valor

# field:party.contact_mechanism,party:
source: Party
pt: Pessoa

# field:party.contact_mechanism,type:
source: Type
pt: Tipo

# field:party.contact_mechanism,value:
source: Value
pt: Valor

# field:party.contact_mechanism,value_compact:
source: Value Compact
pt: Valor Compacto

# field:party.contact_mechanism,website:
source: Website
pt: Sítio web

# field:party.contact_mechanism.language,contact_mechanism:
source: Contact Mechanism
pt: Meio de contato

# field:party.contact_mechanism.language,language:
source: Language
pt: Idioma

# field:party.erase.ask,party:
source: Party
pt: Pessoa

# field:party.identifier,address:
source: Address
pt: Endereço

# field:party.identifier,code:
source: Code
pt: Código

# field:party.identifier,party:
source: Party
pt: Pessoa

# field:party.identifier,type:
source: Type
pt: Tipo

# field:party.identifier,type_address:
source: Type of Address
pt: Tipo de Endereço

# field:party.party,addresses:
source: Addresses
pt: Endereços

# field:party.party,categories:
source: Categories
pt: Categorias

# field:party.party,code:
source: Code
pt: Código

# field:party.party,code_readonly:
source: Code Readonly
pt: Código somente leitura

# field:party.party,contact_mechanisms:
source: Contact Mechanisms
pt: Meios de contato

# field:party.party,distance:
source: Distance
pt: Distância

# field:party.party,full_name:
source: Full Name
pt: Nome completo

# field:party.party,identifiers:
source: Identifiers
pt: Identificadores

# field:party.party,lang:
source: Language
pt: Idioma

# field:party.party,langs:
source: Languages
pt: Idiomas

# field:party.party,mobile:
source: Mobile
pt: Celular

# field:party.party,name:
source: Name
pt: Nome

# field:party.party,phone:
source: Phone
pt: Telefone

# field:party.party,replaced_by:
source: Replaced By
pt: Substituído Por

# field:party.party,tax_identifier:
source: Tax Identifier
pt: Identificador de Tributo

# field:party.party,website:
source: Website
pt: Sítio web

# field:party.party-party.category,category:
source: Category
pt: Categoria

# field:party.party-party.category,party:
source: Party
pt: Pessoa

# field:party.party.lang,lang:
source: Language
pt: Idioma

# field:party.party.lang,party:
source: Party
pt: Pessoa

# field:party.replace.ask,destination:
source: Destination
pt: Destino

# field:party.replace.ask,source:
source: Source
pt: Fonte

# help:ir.email.template,contact_mechanism:
source: Define which email address to use from the party's contact mechanisms.
pt: Defina qual endereço de email da lista de contatos da pessoa deve ser usado.

# help:party.address,party_name:
source: If filled, replace the name of the party for address formatting
pt: Se preenchido, substitui o nome da pessoa ao formatar o endereço

# help:party.address.format,building_number_format:
source: Use {} as placeholder for the number.
pt: Use {} como espaço reservado para o número.

# help:party.address.format,floor_number_format:
source: Use {} as placeholder for the number.
pt: Use {} como espaço reservado para o número.

# help:party.address.format,format_:
source: Available variables (also in upper case and street variables): - ${party_name} - ${attn} - ${street} - ${postal_code} - ${city} - ${subdivision} - ${subdivision_code} - ${country} - ${country_code}
pt: Variáveis disponíveis (também em caixa alta): - ${party_name}(nome da pessoa) - ${attn}(aos cuidados) - ${street}(rua) - ${postal_code}(código postal) - ${city}(cidade) - ${subdivision}(Estado) - ${subdivision_code}(Código do Estado) - ${country}(País) - ${country_code}(Código do País)

# help:party.address.format,post_box_format:
source: Use {} as placeholder for the number.
pt: Use {} como espaço reservado para o número.

# help:party.address.format,post_office_format:
source: Use {} as placeholder for the number.
pt: Use {} como espaço reservado para o número.

# help:party.address.format,private_bag_format:
source: Use {} as placeholder for the number.
pt: Use {} como espaço reservado para o número.

# help:party.address.format,room_number_format:
source: Use {} as placeholder for the number.
pt: Use {} como espaço reservado para o número.

# help:party.address.format,street_format:
source: Available variables (also in upper case): - ${street_name} - ${building_name} - ${building_number} - ${unit_number} - ${floor_number} - ${room_number} - ${post_box} - ${private_bag} - ${post_office}
pt: Variáveis disponíveis (também em caixa alta): - ${street_name} - ${building_name} - ${building_number} - ${unit_number} - ${floor_number} - ${room_number} - ${post_box} - ${private_bag} - ${post_office}

# help:party.address.format,unit_number_format:
source: Use {} as placeholder for the number.
pt: Use {} como espaço reservado para o número.

# help:party.category,childs:
source: Add children below the category.
pt: Adicione filhos abaixo da categoria.

# help:party.category,name:
source: The main identifier of the category.
pt: O principal identificador da categoria.

# help:party.category,parent:
source: Add the category below the parent.
pt: Adicione a categoria abaixo do pai.

# help:party.configuration,identifier_types:
source: Defines which identifier types are available. Leave empty for all of them.
pt: Defina os tipos de identificadores que estão disponíveis. Deixe vazio para selecionar todos.

# help:party.configuration,party_lang:
source: The default language for new parties.
pt: O idioma padrão para novas pessoas.

# help:party.configuration,party_sequence:
source: Used to generate the party code.
pt: Utilizado para gerar o código das pessoas.

# help:party.configuration.party_lang,party_lang:
source: The default language for new parties.
pt: O idioma padrão para novas pessoas.

# help:party.configuration.party_sequence,party_sequence:
source: Used to generate the party code.
pt: Utilizado para gerar o código das pessoas.

# help:party.contact_mechanism,language:
source: Used to translate communication made using the contact mechanism. Leave empty for the party language.
pt: Usado para traduzir comunicação usando os mecanismos de contato. Deixe vazio para usar o idioma da pessoa.

# help:party.erase.ask,party:
source: The party to be erased.
pt: A pessoa a ser excluída.

# help:party.identifier,address:
source: The address identified by this record.
pt: O endereço identificado por este registro.

# help:party.identifier,party:
source: The party identified by this record.
pt: A pessoa identificada por este registro.

# help:party.party,categories:
source: The categories the party belongs to.
pt: As categorias às quais a pessoa pertence.

# help:party.party,code:
source: The unique identifier of the party.
pt: O identificador único da pessoa.

# help:party.party,identifiers:
source: Add other identifiers of the party.
pt: Adicionar outros identificadores à pessoa.

# help:party.party,lang:
source: Used to translate communications with the party.
pt: Usado para traduzir comunicação com a pessoa.

# help:party.party,name:
source: The main identifier of the party.
pt: O identificador principal da pessoa.

# help:party.party,replaced_by:
source: The party replacing this one.
pt: A pessoa que substitui esta.

# help:party.party,tax_identifier:
source: The identifier used for tax report.
pt: O identificador usado para relatório fiscal.

# help:party.replace.ask,destination:
source: The party that replaces.
pt: A pessoa que substitui.

# help:party.replace.ask,source:
source: The party to be replaced.
pt: A pessoa a ser substituída.

# model:ir.action,name:act_address_form
source: Addresses
pt: Endereços

# model:ir.action,name:act_address_format_form
source: Address Formats
pt: Formatos de Endereços

# model:ir.action,name:act_address_subdivision_type_form
source: Address Subdivision Types
pt: Tipo de Subdivisão de Endereço

# model:ir.action,name:act_category_list
source: Categories
pt: Categorias

# model:ir.action,name:act_category_tree
source: Categories
pt: Categorias

# model:ir.action,name:act_contact_mechanism_form
source: Contact Mechanisms
pt: Meios de contato

# model:ir.action,name:act_party_by_category
source: Parties by Category
pt: Pessoas por Categoria

# model:ir.action,name:act_party_configuration_form
source: Configuration
pt: Configuração

# model:ir.action,name:act_party_form
source: Parties
pt: Pessoas

# model:ir.action,name:report_label
source: Labels
pt: Etiquetas

# model:ir.action,name:wizard_check_vies
source: Check VIES
pt: Verificar VIES

# model:ir.action,name:wizard_erase
source: Erase
pt: Apagar

# model:ir.action,name:wizard_replace
source: Replace
pt: Substituir

# model:ir.message,text:msg_address_change_party
source: You cannot change the party of address "%(address)s".
pt: Você não pode alterar a pessoa do endereço "%(address)s".

# model:ir.message,text:msg_address_subdivision_country_code_unique
source: The country code on subdivision type must be unique.
pt: O código do país no tipo de subdivisão deve ser único.

# model:ir.message,text:msg_category_name_unique
source: The name of party category must be unique by parent.
pt: O nome da categoria de pessoa deve ser único por categoria pai.

# model:ir.message,text:msg_contact_mechanism_change_party
source: You cannot change the party of contact mechanism "%(contact)s".
pt: Você não pode alterar a pessoa da forma de contato "%(contact)s".

# model:ir.message,text:msg_different_name
source: Parties have different names: "%(source_name)s" vs "%(destination_name)s".
pt: Pessoas têm diferentes nomes: %(source_name)s vs %(destination_name)s.

# model:ir.message,text:msg_different_tax_identifier
source: Parties have different tax identifiers: "%(source_code)s" vs "%(destination_code)s".
pt: Pessoas têm diferentes Identificadores de Tributos: %(source_code)s vs %(destination_code)s.

# model:ir.message,text:msg_email_invalid
source: The email address "%(email)s" for party "%(party)s" is not valid.
pt: O endereço de email "%(email)s" da pessoa "%(party)s" é inválido.

# model:ir.message,text:msg_erase_active_party
source: Party "%(party)s" cannot be erased because they are still active.
pt: A pessoa "%(party)s" não pode ser removida, pois está ativa.

# model:ir.message,text:msg_identifier_type_remove
source: To remove the identifier type "%(type)s" from the configuration, you must change it on "%(identifier)s".
pt: Para remover o tipo de identificador "%(type)s" da configuração você precisa modificá-lo em "%(identifier)s".

# model:ir.message,text:msg_invalid_code
source: The %(type)s "%(code)s" for party "%(party)s" is not valid.
pt: Os %(type)s " "%(code)s" da pessoa "%(party)s" é inválido.

# model:ir.message,text:msg_invalid_format
source: Invalid format "%(format)s" with exception "%(exception)s".
pt: Formato inválido "%(format)s" com exceção "%(exception)s".

# model:ir.message,text:msg_invalid_phone_number
source: The phone number "%(phone)s" for party "%(party)s" is not valid.
pt: O número de telefone "%(phone)s" da pessoa "%(party)s" é inválido.

# model:ir.message,text:msg_party_code_unique
source: The code on party must be unique.
pt: O código da pessoa deve ser único.

# model:ir.message,text:msg_party_contact_mechanism_duplicate
source: The party "%(party)s" has the same %(type)s "%(value)s".
pt: A pessoa "%(party)s" possui o mesmo %(type)s "%(value)s".

# model:ir.message,text:msg_party_identifier_duplicate
source: The party "%(party)s" has the same %(type)s "%(code)s".
pt: A pessoa "%(party)s" possui o mesmo %(type)s "%(code)s".

# model:ir.message,text:msg_party_set_contact_mechanism
source: To change the "%(field)s" for party "%(party)s", you must edit their contact mechanisms.
pt: Para modificar o(s) "%(field)s" da pessoa "%(party)s" você precisa editar os mecanismos de contato.

# model:ir.message,text:msg_vies_unavailable
source: The VIES service is unavailable, try again later.
pt: O serviço VIES está indisponível. Tente mais tarde.

# model:ir.sequence,name:sequence_party
source: Party
pt: Pessoa

# model:ir.sequence.type,name:sequence_type_party
source: Party
pt: Pessoa

# model:ir.ui.menu,name:menu_address_form
source: Addresses
pt: Endereços

# model:ir.ui.menu,name:menu_address_format_form
source: Address Formats
pt: Formatos de Endereços

# model:ir.ui.menu,name:menu_address_subdivision_type_form
source: Address Subdivision Types
pt: Tipo de Subdivisão de Endereço

# model:ir.ui.menu,name:menu_category_list
source: Categories
pt: Categorias

# model:ir.ui.menu,name:menu_category_tree
source: Categories
pt: Categorias

# model:ir.ui.menu,name:menu_configuration
source: Configuration
pt: Configuração

# model:ir.ui.menu,name:menu_contact_mechanism_form
source: Contact Mechanisms
pt: Meios de contato

# model:ir.ui.menu,name:menu_party
source: Parties
pt: Pessoas

# model:ir.ui.menu,name:menu_party_configuration
source: Configuration
pt: Configuração

# model:ir.ui.menu,name:menu_party_form
source: Parties
pt: Pessoas

# model:party.address,string:
source: Party Address
pt: Endereço da Pessoa

# model:party.address.format,string:
source: Party Address Format
pt: Formato de Endereço da Pessoa

# model:party.address.subdivision_type,string:
source: Party Address Subdivision Type
pt: Tipo de Subdivisão de Endereço da Festa

# model:party.category,string:
source: Party Category
pt: Categoria da Pessoa

# model:party.check_vies.result,string:
source: Party Check Vies Result
pt: Resultado da Verificação da Pessoa

# model:party.configuration,string:
source: Party Configuration
pt: Configuração da Pessoa

# model:party.configuration.party_lang,string:
source: Party Configuration Party Lang
pt: Configuração de Idioma da Pessoa

# model:party.configuration.party_sequence,string:
source: Party Configuration Party Sequence
pt: Configuração de Sequências da Pessoa

# model:party.contact_mechanism,string:
source: Party Contact Mechanism
pt: Meio de Contato da Pessoa

# model:party.contact_mechanism.language,string:
source: Party Contact Mechanism Language
pt: Idioma do Meio de Contato da Pessoa

# model:party.erase.ask,string:
source: Party Erase Ask
pt: Nome da Pessoa

# model:party.identifier,string:
source: Party Identifier
pt: Identificador da Pessoa

# model:party.party,string:
source: Party
pt: Pessoa

# model:party.party-party.category,string:
source: Party - Party Category
pt: Pessoa - Categoria da Pessoa

# model:party.party.lang,string:
source: Party Lang
pt: País da Pessoa

# model:party.replace.ask,string:
source: Party Replace Ask
pt: Substituir Pessoa

# model:res.group,name:group_party_admin
source: Party Administration
pt: Administração de Pessoas

# selection:party.configuration,identifier_types:
source: Albanian VAT Number
pt: Número VAT Albanês

# selection:party.configuration,identifier_types:
source: Algerian Tax Number
pt: Número Algeriano

# selection:party.configuration,identifier_types:
source: Andorra Tax Number
pt: Número de Andorra

# selection:party.configuration,identifier_types:
source: Argentinian National Identity Number
pt: Número de Identidade Nacional Argentino

# selection:party.configuration,identifier_types:
source: Argentinian Tax Number
pt: Número de Documento Argentino

# selection:party.configuration,identifier_types:
source: Australian Business Number
pt: Número de Documento Australiano

# selection:party.configuration,identifier_types:
source: Australian Company Number
pt: Número da Empresa Australiana

# selection:party.configuration,identifier_types:
source: Australian Tax File Number
pt: Identificador fiscal Australiano

# selection:party.configuration,identifier_types:
source: Austrian Company Register
pt: Registro de Companhia Austríaco

# selection:party.configuration,identifier_types:
source: Austrian Social Security Number
pt: Número de Segurança Pública Austríaco

# selection:party.configuration,identifier_types:
source: Austrian Tax Identification
pt: Identificador Fiscal Austríaco

# selection:party.configuration,identifier_types:
source: Austrian Umsatzsteuer-Identifikationsnummer
pt: Número Identificador de Custo de Vendas Austríaco

# selection:party.configuration,identifier_types:
source: Belarus VAT Number
pt: Número VAT de Belarus

# selection:party.configuration,identifier_types:
source: Belgian BIS Number
pt: Número BIS Belga

# selection:party.configuration,identifier_types:
source: Belgian Enterprise Number
pt: Número de Companhia Belga

# selection:party.configuration,identifier_types:
source: Belgian National Number
pt: Número Nacional Belga

# selection:party.configuration,identifier_types:
source: Brazillian Company Identifier
pt: Código Nacional de Pessoa Jurídica Brasileiro

# selection:party.configuration,identifier_types:
source: Brazillian National Identifier
pt: Cadastro de Pessoa Física Brasileiro

# selection:party.configuration,identifier_types:
source: Bulgarian Number of a Foreigner
pt: Número de Estrangeiro Búlgaro

# selection:party.configuration,identifier_types:
source: Bulgarian Personal Identity Codes
pt: Código de Identificação Pessoal Búlgaro

# selection:party.configuration,identifier_types:
source: Bulgarian VAT Number
pt: Número VAT Búlgaro

# selection:party.configuration,identifier_types:
source: Canadian Business Number
pt: Documento Empresarial Canadense

# selection:party.configuration,identifier_types:
source: Canadian Social Insurance Number
pt: Número de Seguro Social Canadense

# selection:party.configuration,identifier_types:
source: Chilean National Tax Number
pt: Número Fiscal Nacional Chileno

# selection:party.configuration,identifier_types:
source: Chinese Resident Identity Card Number
pt: Número de Cartão de Identidade de Residentes Chineses

# selection:party.configuration,identifier_types:
source: Chinese Unified Social Credit Code
pt: Código Unificado de Crédito Social Chinês

# selection:party.configuration,identifier_types:
source: Colombian Identity Code
pt: Código de Identificação Colombiano

# selection:party.configuration,identifier_types:
source: Costa Rica Foreigners ID Number
pt: Número ID de Estrangeiros da Costa Rica

# selection:party.configuration,identifier_types:
source: Costa Rica Physical Person ID Number
pt: Número ID de Pessoa Física da Costa Rica

# selection:party.configuration,identifier_types:
source: Costa Rica Tax Number
pt: Número Fiscal da Costa Rica

# selection:party.configuration,identifier_types:
source: Croatian Identification Number
pt: Número de Identificação Croata

# selection:party.configuration,identifier_types:
source: Cuban Identity Card Number
pt: Número de Cartão de Identidade Cubano

# selection:party.configuration,identifier_types:
source: Cypriot VAT Number
pt: Número VAT de Cipriota

# selection:party.configuration,identifier_types:
source: Czech National Identifier
pt: Identificador Nacional Tcheco

# selection:party.configuration,identifier_types:
source: Czech VAT Number
pt: Número VAT Tcheco

# selection:party.configuration,identifier_types:
source: Danish Citizen Number
pt: Número de Cidadão Dinamarquês

# selection:party.configuration,identifier_types:
source: Danish VAT Number
pt: Número VAT Dinamarquês

# selection:party.configuration,identifier_types:
source: Dominican Republic National Identification Number
pt: Número de Identificação Nacional da República Dominicana

# selection:party.configuration,identifier_types:
source: Dominican Republic Tax
pt: Número Fiscal da República Dominicana

# selection:party.configuration,identifier_types:
source: Dutch Citizen Identification Number
pt: Número de Identificação Cidadã Holandês

# selection:party.configuration,identifier_types:
source: Dutch School Identification Number
pt: Número de Identificação Escolar Holandês
