Repository: pypi-data/pypi-mirror-344
Catalog: packages/trytond-product-cost-warehouse/trytond_product_cost_warehouse-7.6.0.tar.gz/trytond_product_cost_warehouse-7.6.0/locale/*.po
Languages: pt

# field:company.company,cost_price_warehouse:
source: Cost Price per Warehouse
pt: Preço de Custo por Armazém

# field:ir.cron,warehouses:
source: Warehouses
pt: Armazéns

# field:ir.cron-stock.warehouse,cron:
source: Cron
pt: Planejador

# field:ir.cron-stock.warehouse,warehouse:
source: Warehouse
pt: Armazém

# field:product.configuration,cost_price_warehouse:
source: Cost Price per Warehouse
pt: Preço de Custo por Armazém

# field:product.configuration.cost_price_warehouse,company:
source: Company
pt: Companhia

# field:product.configuration.cost_price_warehouse,cost_price_warehouse:
source: Cost Price per Warehouse
pt: Preço de Custo por Armazém

# field:product.cost_price,warehouse:
source: Warehouse
pt: Armazém

# field:product.cost_price,warehouse_required:
source: Warehouse Required
pt: Armazém Obrigatório

# field:product.cost_price.revision,warehouse:
source: Warehouse
pt: Armazém

# field:product.cost_price.revision,warehouse_required:
source: Warehouse Required
pt: Armazém Obrigatório

# field:stock.location,cost_warehouse:
source: Cost Warehouse
pt: Custo do Armazém

# help:company.company,cost_price_warehouse:
source: Compute product cost price for each warehouse.
pt: Calcular preço de custo do produto para cada armazém.

# help:ir.cron,warehouses:
source: Warehouses registered for this cron.
pt: Armazéns registrados para esse planejador.

# help:product.configuration,cost_price_warehouse:
source: Compute product cost price for each warehouse.
pt: Calcular preço de custo do produto para cada armazém.

# help:product.configuration.cost_price_warehouse,cost_price_warehouse:
source: Compute product cost price for each warehouse.
pt: Calcular preço de custo do produto para cada armazém.

# model:ir.cron-stock.warehouse,string:
source: Cron - Stock Warehouse
pt: Planejador - Estoque do Armazém

# model:ir.message,text:msg_move_storage_location_same_warehouse
source: To move products between "%(from_)s" and "%(to)s", you must use the internal shipment transit location.
pt: Para mover produtos entre "%(from_)s" e "%(to)s", é necessário usar o local de envio interno.

# model:product.configuration.cost_price_warehouse,string:
source: Product Configuration Cost Price Warehouse
pt: Configuração do Preço de Custo do Armazém
