Repository: pypi-data/pypi-mirror-344
Catalog: packages/trytond-web-shop-product-data-feed/trytond_web_shop_product_data_feed-7.6.0.tar.gz/trytond_web_shop_product_data_feed-7.6.0/locale/*.po
Languages: pt

# field:product.category.facebook,code:
source: Code
pt: Código

# field:product.category.facebook,name:
source: Name
pt: Nome

# field:product.category.google,code:
source: Code
pt: Código

# field:product.category.google,name:
source: Name
pt: Nome

# field:product.product,facebook_category:
source: Facebook Category
pt: Categoria do Facebook

# field:product.product,google_category:
source: Google Category
pt: Categoria do Google

# field:product.template,facebook_category:
source: Facebook Category
pt: Categoria do Facebook

# field:product.template,google_category:
source: Google Category
pt: Categoria do Google

# field:web.shop,product_image_url_template:
source: Product Image URL
pt: URL da Imagem do Produto

# field:web.shop,product_url_template:
source: Product URL
pt: URL do Produto

# help:web.shop,product_image_url_template:
source: The template to generate the indexed product image URL. The following placeholders can be used: - ${id} - ${code} - ${name} - ${language} - ${index}
pt: O modelo para gerar a URL da imagem indexada do produto. Os seguintes marcadores de posição podem ser usados: - ${id} - ${code} - ${name} - ${language} - ${index}

# help:web.shop,product_url_template:
source: The template to generate the product URL on the web shop. The following placeholders can be used: - ${id} - ${code} - ${name} - ${language}
pt: O modelo para gerar a URL do produto na loja virtual. Os seguintes marcadores de posição podem ser usados: - ${id} - ${code} - ${name} - ${language}

# model:ir.action,name:act_product_category_facebook_form
source: Facebook Product Categories
pt: Categorias de Produtos do Facebook

# model:ir.action,name:act_product_category_google_form
source: Google Product Categories
pt: Categorias de Produtos do Google

# model:ir.ui.menu,name:menu_product_category_facebook_form
source: Facebook Product Categories
pt: Categorias de Produtos do Facebook

# model:ir.ui.menu,name:menu_product_category_google_form
source: Google Product Categories
pt: Categorias de Produtos do Google

# model:product.category.facebook,string:
source: Product Category Facebook
pt: Categoria de Produto Facebook

# model:product.category.google,string:
source: Product Category Google
pt: Categoria de Produto Google

# selection:ir.cron,method:
source: Update Web Shop Product Data Feed
pt: Atualizar Feed de Dados de Produtos da Loja virtual
