Repository: pypi-data/pypi-mirror-344
Catalog: packages/diacamma-pro/diacamma_pro-2.7.1.25042413-py3-none-any.whl/diacamma/microbusiness/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Diacamma micro-business
fr: Diacamma micro-entreprise

source: year
fr: année

source: quarter
fr: trimestre

source: 1st quarter
fr: 1er trimestre

source: 2nd quarter
fr: 2ème trimestre

source: 3rd quarter
fr: 3ème trimestre

source: 4st quarter
fr: 4ème trimestre

source: amount service
fr: Chiffre d'affaires des prestations de services commerciales ou artisanales

source: amount sell
fr: Chiffre d'affaires des ventes de marchandises

source: amount other
fr: Chiffre d'affaires des autres prestations de services

source: date begin
fr: date début

source: date end
fr: date fin

source: %(quarter)s of %(year)d
fr: %(quarter)s de %(year)d

source: social declaration
fr: déclaration sociale

source: social declarations
fr: déclarations sociales

source: microbusiness-simple-socialdeclaration
fr: Déclarations socials simplifiées

source: microbusiness-sellaccount
fr: Codes comptables des ventes de marchandises

source: microbusiness-serviceaccount
fr: Codes comptables des prestations de services commerciales ou artisanales

source: # micro-business (editor)
fr: # microentreprise (éditeur)

source: Microbusiness
fr: Microentreprise

source: Microbusiness tools
fr: Outils de microentreprise

source: Management of business parameters
fr: Gestion des paramètres de micro-entreprise

source: Microbusiness configuration
fr: Configuration de microentreprise

source: Management of social declarations
fr: Gestion des déclarations sociales

source: Social declarations
fr: Déclarations sociales

source: Show social declarations
fr: Consulter une période de déclaration sociale

source: Calcul social declarations
fr: Calcul des déclarations sociales

source: Calcul this social declaration ?
fr: Voulez vous calculer les déclarations sociales de cette période ?
