Repository: pypi-data/pypi-mirror-344
Catalog: packages/trytond-country/trytond_country-7.6.0-py3-none-any.whl/trytond/modules/country/locale/*.po
Languages: pt

# field:country.country,code3:
source: 3-letters Code
pt: Código de três letras

# field:country.country,code:
source: Code
pt: Código

# field:country.country,code_numeric:
source: Numeric Code
pt: Código numérico

# field:country.country,flag:
source: Flag
pt: Bandeira

# field:country.country,members:
source: Members
pt: Integrantes

# field:country.country,name:
source: Name
pt: Nome

# field:country.country,organizations:
source: Organizations
pt: Organizações

# field:country.country,region:
source: Region
pt: Região

# field:country.country,subdivisions:
source: Subdivisions
pt: Subdivisões

# field:country.organization,code:
source: Code
pt: Código

# field:country.organization,countries:
source: Countries
pt: Países

# field:country.organization,members:
source: Members
pt: Integrantes

# field:country.organization,name:
source: Name
pt: Nome

# field:country.organization.member,active:
source: Active
pt: Ativo

# field:country.organization.member,country:
source: Country
pt: País

# field:country.organization.member,from_date:
source: From Date
pt: A partir da data

# field:country.organization.member,organization:
source: Organization
pt: Organização

# field:country.organization.member,to_date:
source: To Date
pt: Até a Data

# field:country.postal_code,city:
source: City
pt: Cidade

# field:country.postal_code,country:
source: Country
pt: País

# field:country.postal_code,postal_code:
source: Postal Code
pt: Código de Endereço Postal

# field:country.postal_code,subdivision:
source: Subdivision
pt: Subdivisão

# field:country.region,code_numeric:
source: Numeric Code
pt: Código Numérico

# field:country.region,countries:
source: Countries
pt: Países

# field:country.region,name:
source: Name
pt: Nome

# field:country.region,parent:
source: Parent
pt: Pai

# field:country.region,subregions:
source: Subregions
pt: Sub-regiões

# field:country.subdivision,code:
source: Code
pt: Código

# field:country.subdivision,country:
source: Country
pt: País

# field:country.subdivision,flag:
source: Flag
pt: Bandeira

# field:country.subdivision,name:
source: Name
pt: Nome

# field:country.subdivision,parent:
source: Parent
pt: Pai

# field:country.subdivision,type:
source: Type
pt: Editado por

# help:country.country,code3:
source: The 3 chars ISO country code.
pt: O código ISO de 3 caracteres do país.

# help:country.country,code:
source: The 2 chars ISO country code.
pt: O código ISO de 2 caracteres do país.

# help:country.country,code_numeric:
source: The ISO numeric country code.
pt: O código numérico ISO do país.

# help:country.country,name:
source: The main identifier of the country.
pt: O identificador principal do país.

# help:country.postal_code,city:
source: The city associated with the postal code.
pt: A cidade associada ao código postal.

# help:country.postal_code,country:
source: The country that contains the postal code.
pt: O país ao qual pertence o código postal.

# help:country.postal_code,subdivision:
source: The subdivision where the postal code is.
pt: A subdivisão à qual pertence o código de endereço postal (CEP).

# help:country.region,code_numeric:
source: UN M49 region code.
pt: Código de região ONU M49.

# help:country.subdivision,code:
source: The ISO code of the subdivision.
pt: O código ISO da subdivisão.

# help:country.subdivision,country:
source: The country where this subdivision is.
pt: O país em que a subdivisão está.

# help:country.subdivision,name:
source: The main identifier of the subdivision.
pt: O identificador principal da subdivisão.

# help:country.subdivision,parent:
source: Add subdivision below the parent.
pt: Adicionar subdivisão abaixo do pai.

# model:country.country,string:
source: Country
pt: País

# model:country.organization,name:organization_amu
source: Arab Maghreb Union
pt: União Árabe Maghreb

# model:country.organization,name:organization_apec
source: Asia-Pacific Economic Cooperation
pt: Cooperação Econômica Ásia-Pacífico

# model:country.organization,name:organization_asean
source: Association of Southeast Asian Nations
pt: Associação de Nações do Sudeste Asiático

# model:country.organization,name:organization_benelux
source: Benelux Union
pt: União Benelux

# model:country.organization,name:organization_can
source: Andean Community
pt: Comunidade Andina

# model:country.organization,name:organization_caricom
source: Caribbean Community
pt: Comunidade do Caribe

# model:country.organization,name:organization_cemac
source: Economic and Monetary Community of Central Africa
pt: Comunidade Económica e Monetária da África Central

# model:country.organization,name:organization_cen-sad
source: Community of Sahel–Saharan States
pt: Comunidade dos Estados Sahel-Saarianos

# model:country.organization,name:organization_comesa
source: Common Market for Eastern and Southern Africa
pt: Mercado Comum da África Oriental e Austral

# model:country.organization,name:organization_eac
source: East African Community
pt: Comunidade da África Oriental

# model:country.organization,name:organization_eccas
source: Economic Community of Central African States
pt: Comunidade Económica do Estados da África Central

# model:country.organization,name:organization_ecowas
source: Economic Community of West African States
pt: Comunidade Económica do Estados da África Ocidental

# model:country.organization,name:organization_eu
source: European Union
pt: União Europeia

# model:country.organization,name:organization_gcc
source: Cooperation Council for the Arab States of the Gulf
pt: Conselho de Cooperação dos Estados Árabes do Golfo

# model:country.organization,name:organization_igad
source: Intergovernmental Authority on Development
pt: Autoridade Intergovernamental Para o Desenvolvimento

# model:country.organization,name:organization_mercosur
source: Southern Common Market
pt: Mercado Comum do Sul - Mercosul

# model:country.organization,name:organization_nafta
source: North American Free Trade Agreement
pt: Tratado Norteamericano de Livre-Comércio

# model:country.organization,name:organization_sadc
source: Southern African Development Community
pt: Comunidade Para o Desenvolvimento da África Austral

# model:country.organization,name:organization_safta
source: South Asian Free Trade Area
pt: Area de Livre-Comércio do Sul da Ásia

# model:country.organization,string:
source: Country Organization
pt: Organização de Países

# model:country.organization.member,string:
source: Country Organization Member
pt: Membro da Organização do País

# model:country.postal_code,string:
source: Country Postal Code
pt: Código Postal do País

# model:country.region,name:region_africa
source: Africa
pt: África

# model:country.region,name:region_americas
source: Americas
pt: América

# model:country.region,name:region_antarctica
source: Antarctica
pt: Antártica

# model:country.region,name:region_asia
source: Asia
pt: Ásia

# model:country.region,name:region_australia_new_zealand
source: Australia and New Zealand
pt: Austrália e Nova Zelândia

# model:country.region,name:region_caribbean
source: Caribbean
pt: Caribe

# model:country.region,name:region_central_america
source: Central America
pt: América Central

# model:country.region,name:region_central_asia
source: Central Asia
pt: Ásia Central

# model:country.region,name:region_channel_islands
source: Channel Islands
pt: Ilhas do Canal

# model:country.region,name:region_eastern_africa
source: Eastern Africa
pt: África Oriental

# model:country.region,name:region_eastern_asia
source: Eastern Asia
pt: Ásia Oriental

# model:country.region,name:region_eastern_europe
source: Eastern Europe
pt: Europa Oriental

# model:country.region,name:region_europe
source: Europe
pt: Europa

# model:country.region,name:region_latin_america_caribbean
source: Latin America and the Caribbean
pt: América Latina e o Caribe

# model:country.region,name:region_melanesia
source: Melanesia
pt: Melanésia

# model:country.region,name:region_micronesia
source: Micronesia
pt: Micronésia

# model:country.region,name:region_middle_africa
source: Middle Africa
pt: África Central

# model:country.region,name:region_north_america
source: North America
pt: América do Norte

# model:country.region,name:region_northern_africa
source: Northern Africa
pt: Norte da África

# model:country.region,name:region_northern_america
source: Northern America
pt: América do Norte

# model:country.region,name:region_northern_europe
source: Northern Europe
pt: Norte da Europa

# model:country.region,name:region_polynesia
source: Polynesia
pt: Polinésia

# model:country.region,name:region_south-eastern_asia
source: South-eastern Asia
pt: Sudeste Asiático

# model:country.region,name:region_south_america
source: South America
pt: América do Sul

# model:country.region,name:region_southern_africa
source: Southern Africa
pt: África do Sul

# model:country.region,name:region_southern_asia
source: Southern Asia
pt: Ásia Meridional

# model:country.region,name:region_southern_europe
source: Southern Europe
pt: Europa Meridional

# model:country.region,name:region_sub-saharan_africa
source: Sub-Saharan Africa
pt: África Subsaariana

# model:country.region,name:region_western_africa
source: Western Africa
pt: África Ocidental

# model:country.region,name:region_western_asia
source: Western Asia
pt: Ásia Ocidental

# model:country.region,name:region_western_europe
source: Western Europe
pt: Europa Ocidental

# model:country.region,name:region_world
source: World
pt: Mundo

# model:country.region,string:
source: Country Region
pt: País Região

# model:country.subdivision,string:
source: Country Subdivision
pt: Subdivisão do País

# model:ir.action,name:act_country_by_region
source: Countries by Region
pt: Países por Região

# model:ir.action,name:act_country_form
source: Countries
pt: Países

# model:ir.action,name:act_organization_form
source: Organizations
pt: Organizações

# model:ir.action,name:act_postal_code_form
source: Postal Codes
pt: Códigos Postais

# model:ir.action,name:act_region_form
source: Regions
pt: Regiões

# model:ir.action,name:act_region_tree
source: Areas
pt: Áreas

# model:ir.ui.menu,name:menu_country
source: Countries
pt: Países

# model:ir.ui.menu,name:menu_country_form
source: Countries
pt: Países

# model:ir.ui.menu,name:menu_organization_form
source: Organizations
pt: Organizações

# model:ir.ui.menu,name:menu_region_form
source: Regions
pt: Regiões

# model:ir.ui.menu,name:menu_region_tree
source: Areas
pt: Áreas

# selection:country.subdivision,type:
source: Administrative Region
pt: Região Administrativa

# selection:country.subdivision,type:
source: Administrative Territory
pt: Território Administrativo

# selection:country.subdivision,type:
source: Administrative area
pt: Área administrativa

# selection:country.subdivision,type:
source: Administrative atoll
pt: Atol administrativo

# selection:country.subdivision,type:
source: Administrative precinct
pt: Circunscrição administrativa

# selection:country.subdivision,type:
source: Autonomous City
pt: Cidade Autônoma

# selection:country.subdivision,type:
source: Autonomous Commune
pt: Comuna Autônoma

# selection:country.subdivision,type:
source: Autonomous District
pt: Distrito Autônomo

# selection:country.subdivision,type:
source: Autonomous Province
pt: Província Autônoma

# selection:country.subdivision,type:
source: Autonomous Region
pt: Região Autônoma

# selection:country.subdivision,type:
source: Autonomous city in north africa
pt: Cidade autônoma no norte da África

# selection:country.subdivision,type:
source: Autonomous communities
pt: Comunidades Autônomas

# selection:country.subdivision,type:
source: Autonomous community
pt: Comunidade autônoma

# selection:country.subdivision,type:
source: Autonomous island
pt: Ilha autônoma

# selection:country.subdivision,type:
source: Autonomous monastic state
pt: Estado monástico autônomo

# selection:country.subdivision,type:
source: Autonomous municipality
pt: Município autônomo

# selection:country.subdivision,type:
source: Autonomous republic
pt: República Autônoma

# selection:country.subdivision,type:
source: Autonomous sector
pt: Setor autônomo

# selection:country.subdivision,type:
source: Autonomous territorial unit
pt: Unidade territorial autônoma

# selection:country.subdivision,type:
source: Autonomous territory
pt: Território autônomo

# selection:country.subdivision,type:
source: Borough
pt: Bairro

# selection:country.subdivision,type:
source: Canton
pt: Cantão

# selection:country.subdivision,type:
source: Capital Metropolitan City
pt: Cidade metropolitana da capital

# selection:country.subdivision,type:
source: Chain (of islands)
pt: Cadeia de ilhas

# selection:country.subdivision,type:
source: Chains (of islands)
pt: Cadeia de ilhas

# selection:country.subdivision,type:
source: City
pt: Cidade

# selection:country.subdivision,type:
source: City corporation
pt: Corporação da cidade

# selection:country.subdivision,type:
source: City municipality
pt: Município

# selection:country.subdivision,type:
source: City with county rights
pt: Cidade com direitos de condado

# selection:country.subdivision,type:
source: Commune
pt: Comuna

# selection:country.subdivision,type:
source: Constitutional province
pt: Província constitucional

# selection:country.subdivision,type:
source: Council area
pt: Área de conselho

# selection:country.subdivision,type:
source: Country
pt: País

# selection:country.subdivision,type:
source: County
pt: Condado

# selection:country.subdivision,type:
source: Decentralized regional entity
pt: Entidade regional descentralizada

# selection:country.subdivision,type:
source: Department
pt: Departamento

# selection:country.subdivision,type:
source: Dependency
pt: Dependência

# selection:country.subdivision,type:
source: Development region
pt: Região de desenvolvimento

# selection:country.subdivision,type:
source: District council area
pt: Área de conselho distrital

# selection:country.subdivision,type:
source: District municipality
pt: Município do distrito

# selection:country.subdivision,type:
source: District with special status
pt: Distrito com status especial

# selection:country.subdivision,type:
source: Districts under republic administration
pt: Distritos sob administração da república

# selection:country.subdivision,type:
source: Economic Prefecture
pt: Prefeitura econômica

# selection:country.subdivision,type:
source: Economic region
pt: Região econômica

# selection:country.subdivision,type:
source: Emirate
pt: Emirado

# selection:country.subdivision,type:
source: Entity
pt: Entidade

# selection:country.subdivision,type:
source: European collectivity
pt: Coletividade Europeia

# selection:country.subdivision,type:
source: Federal Dependency
pt: Dependência Federal

# selection:country.subdivision,type:
source: Federal Territory
pt: Território Federal

# selection:country.subdivision,type:
source: Federal capital territory
pt: Território da capital federal

# selection:country.subdivision,type:
source: Federal entity
pt: Entidade Federal

# selection:country.subdivision,type:
source: Free municipal consortium
pt: Consórcio municipal livre

# selection:country.subdivision,type:
source: Geographical entity
pt: Entidade geográfica

# selection:country.subdivision,type:
source: Geographical region
pt: Região geográfica

# selection:country.subdivision,type:
source: Geographical unit
pt: Unidade geográfica

# selection:country.subdivision,type:
source: Governorate
pt: Governadoria

# selection:country.subdivision,type:
source: Group of islands (20 inhabited islands)
pt: Grupo de ilhas (20 ilhas sem habitantes)

# selection:country.subdivision,type:
source: Included for completeness
pt: Incluído para completar

# selection:country.subdivision,type:
source: Indigenous region
pt: Região indígena

# selection:country.subdivision,type:
source: Island council
pt: Conselho da ilha

# selection:country.subdivision,type:
source: Island group
pt: Grupo de ilhas

# selection:country.subdivision,type:
source: Islands, groups of islands
pt: Ilhas, grupos de ilhas

# selection:country.subdivision,type:
source: Land
pt: Terras

# selection:country.subdivision,type:
source: Local council
pt: Conselho local

# selection:country.subdivision,type:
source: London borough
pt: Bairro de Londres

# selection:country.subdivision,type:
source: Metropolitan administration
pt: Administração metropolitana

# selection:country.subdivision,type:
source: Metropolitan cities
pt: Cidades metropolitanas

# selection:country.subdivision,type:
source: Metropolitan city
pt: Cidade metropolitana

# selection:country.subdivision,type:
source: Metropolitan collectivity with special status
pt: Coletivo metropolitano com status especial

# selection:country.subdivision,type:
source: Metropolitan department
pt: Departamento metropolitano

# selection:country.subdivision,type:
source: Metropolitan district
pt: Distrito metropolitano

# selection:country.subdivision,type:
source: Metropolitan region
pt: Região metropolitana

# selection:country.subdivision,type:
source: Municipalities
pt: Municípios

# selection:country.subdivision,type:
source: Municipality
pt: Município

# selection:country.subdivision,type:
source: Nation
pt: Nação

# selection:country.subdivision,type:
source: Overseas collectivity
pt: Coletividade no exterior

# selection:country.subdivision,type:
source: Overseas collectivity with special status
pt: Coletividade no exterior com status especial

# selection:country.subdivision,type:
source: Overseas department
pt: Departamento no Exterior

# selection:country.subdivision,type:
source: Overseas departmental collectivity
pt: Coletividade Departamental no Exterior

# selection:country.subdivision,type:
source: Overseas region
pt: Região no Exterior

# selection:country.subdivision,type:
source: Overseas region/department
pt: Região/departamento no exterior

# selection:country.subdivision,type:
source: Overseas territorial collectivity
pt: Coletividade territorial no exterior

# selection:country.subdivision,type:
source: Overseas territory
pt: Território no exterior

# selection:country.subdivision,type:
source: Overseas unique territorial collectivity
pt: Coletividade Territorial Única no Exterior

# selection:country.subdivision,type:
source: Pakistan administered area
pt: Área administrada pelo Paquistão

# selection:country.subdivision,type:
source: Parish
pt: Paróquia

# selection:country.subdivision,type:
source: Popularates
pt: Populares

# selection:country.subdivision,type:
source: Prefecture
pt: Província

# selection:country.subdivision,type:
source: Principality
pt: Principado

# selection:country.subdivision,type:
source: Quarter
pt: Quarteirão

# selection:country.subdivision,type:
source: Rayon
pt: Raion

# selection:country.subdivision,type:
source: Region
pt: Região

# selection:country.subdivision,type:
source: Regional council
pt: Conselho regional

# selection:country.subdivision,type:
source: Regional state
pt: Estado regional

# selection:country.subdivision,type:
source: Republican City
pt: Cidade da republica

# selection:country.subdivision,type:
source: Rural municipality
pt: Município rural

# selection:country.subdivision,type:
source: Self-governed part
pt: Parte auto-governada

# selection:country.subdivision,type:
source: Special Municipality
pt: Município especial

# selection:country.subdivision,type:
source: Special administrative city
pt: Cidade administrativa especial

# selection:country.subdivision,type:
source: Special administrative region
pt: Região administrativa especial

# selection:country.subdivision,type:
source: Special island authority
pt: Autoridade insular especial

# selection:country.subdivision,type:
source: Special self-governing city
pt: Cidade de autogoverno especial

# selection:country.subdivision,type:
source: Special self-governing province
pt: Província de autogoverno especial

# selection:country.subdivision,type:
source: State
pt: Estado

# selection:country.subdivision,type:
source: State city
pt: Cidade do Estado

# selection:country.subdivision,type:
source: Territorial unit
pt: Unidade territorial

# selection:country.subdivision,type:
source: Town
pt: Vila

# selection:country.subdivision,type:
source: Town council
pt: Conselho municipal

# selection:country.subdivision,type:
source: Two-tier county
pt: Condado de dois níveis

# selection:country.subdivision,type:
source: Unitary authority
pt: Autoridade unitária

# selection:country.subdivision,type:
source: Unitary authority (england)
pt: Autoridade unitária (Inglaterra)

# selection:country.subdivision,type:
source: Unitary authority (wales)
pt: Autoridade unitária (País de Gales)

# selection:country.subdivision,type:
source: Urban community
pt: Comunidade urbana

# selection:country.subdivision,type:
source: Urban municipality
pt: Municipalidade urbana

# selection:country.subdivision,type:
source: Voivodship
pt: Voivodia

# selection:country.subdivision,type:
source: Ward
pt: Divisão
